#include <iostream>

int main()
{
	////////// chapter19: STL //////////
	// Standard Template Library (표준 템플릿 라이브러리)
	// 1. 반복자:	포인터를 추상화 (반복자는 맴버 변수로 포인터, 이를 활용하는 맴버 함수를 가짐)
	//				컨테이너와 내부의 요소는 서로 자료형에 영향을 주지 않음
	//				(어떤곳에 어떤것을 넣어도 상관없이 무언가를 저장, 접근 가능)
	//				STL은 반복자를 사용해 요소에 접근해서 처리
	//				반복자는 컨테이너의 자료형, 요소의 자료형과 상관없이 사용

	// 2. 컨테이너: 
	//	1) 시퀀스 컨테이너: 
	//	2) 컨테이너 어탭터: 
	//	3) 연관 컨테이너: 

	// 3. 알고리즘:	컨테이너 요소에 적용할 연산
	//	1) 비변경:	컨테이너의 구조를 변경하지 않음
	//	2) 변경:		컨테이너의 구조를 변경
	//	3) 정렬:		컨테이너의 요소를 정렬
	//	4) 수치:		숫자 요소에 수학 처리

	// 4. 함수와 함수 객체: ?







	return 0;
}